//file: relation.c

#include <stdio.h>

int main(void)
{
	printf("(3 > 4) 결과값: %d\n", (3 > 4));	//3 > 4) 결과값: 0
	printf("(3 < 4.0) 결과값: %d\n", (3 < 4.0));	// (3 < 4.0) 결과값: 1
	printf("('a' <= 'b') 결과값: %d\n", ('a' <= 'b'));	//('a' <= 'b') 결과값: 1
	printf("('Z' <= 'a') 결과값: %d\n", ('Z' <= 'a'));	// ('Z' <= 'a') 결과값: 1
	printf("(4.27 >= 4.35) 결과값: %d\n", (4.27 >= 4.35));	//(4.27 >= 4.35) 결과값: 0
	printf("(4 != 4.0) 결과값: %d\n", (4 != 4.0));	//(4 != 4.0)결과값: 0
	printf("(4.0F == 4.0) 결과값: %d\n", (4.0F == 4.0));	//(4.0F ==4.0) 결과값:1

	return 0;
}