// file: priority.c

#include <stdio.h>

int main(void)
{

	int a = 4, b = 6;
	double x = 3.3, y = 4.7;

	//»ê¼ú > °ü°è > ³í¸®, ((a+b) > y) && (x<y) => ((4+6)>4.7) && (3.3<4.7) ==> 1
	printf("%d", a + b > y && x < y);

	//´ÜÇ× > °ö¼À> »¬¼À, ((a++) - ((--b)/2)) => -6
	printf("%d", a++ - --b * 2);

	//»ê¼ú > °ü°è > Á¶°Ç, (a>b)?(x+1):(y+2) => (5>5)?(3.3+1):(4.7*2) => 9.4
	printf("%lf", a > b ? x + 1 : y * 2);

	//»ê¼ú > ³í¸®> ´ëÀÔ, x += (3 && (y+2)), x = x + 1 => 4.300000
	printf("%d", x += 3 && y + 2);

	//°ñÈ£ > »ê¼ú> ´ëÀÔ> ÄÞ¸¶, ((x=x+1), (y=y+1)) => 5.700000
	printf("%lf\n", (x = x + 1, y = y + 1));

	return 0;
}